{"pages":[],"posts":[{"title":"Switch branch in git","text":"Well How do we switch branches1$ git switch -C remote/&lt;branch-name&gt; Simple just switch buddy !","link":"/peckingatcode/2020/03/31/switch-branch-in-git/"},{"title":"A Quick dive into git stash","text":"To list out all the stashs 1$ git stash list To list out contents of a specific stash 1$ git stash show stash@{0} -p To list out just the name of the files (not the contents) 1$ git stash show stash@{0} --name-only","link":"/peckingatcode/2020/04/04/quick-dive-into-git-stash/"},{"title":"Productivity - win tasks and fail tasks","text":"Fail taskOne way to boast productivity is have tasks in you’re list that are fail tasks. Basically you assign the tasks a time constrain and then write the word ‘FAIL’ besides it , this lowers the mental pressure on you’re self. Adding the time constrain basically enables you to not be stuck on the same tasks for hours on end and adding the word ‘FAIL’ rids you of the pressure or guilt of not completing it. This type of a to do task comes in handy when you’re working on something that’s basically R&amp;D or you’re likely to procrastinate. Win taskWin tasks is basically a task that i would usually add to the beginning of my day, just to kick off my day and give me the feeling that i have accomplished something meaningful right at the offset of the day. Its a good way to kick off you’re schedule.","link":"/peckingatcode/2020/04/07/productivity-win-tasks-and-fail-tasks/"},{"title":"Svg letter gradient animation","text":"Lets use the below image created in inkscape to create a animation. to be continued…","link":"/peckingatcode/2020/05/02/svg-letter-gradient-animation/"},{"title":"Keep your day productive","text":"Alright class , lets take a dive into what are some of the simple habits/tips/tricks that you can use to keep your day produvtive snd end up with a day which seems ‘satifying’. Bear in mind , effort can be seen by people watching you but satisfaction can’t be , because its something that you feel at the end of the day just before you turn off the lights and go to bed. You are not infallable. Use a systemHave a rough schedule , eg. 8:30 - 10:00 is the time frame in which i shower , meditate and have my dinner. Its written in a evernote and my brain everyday does’t have to process as to what do i have to do that this point in time. I just do it, on auto-pilot. Use technology to assit you.Tired of your mobile addiction. stop relying on the old-school technique of self-control and use an app called lock-out, set time and it will auto lock you out for that duration. tired of your irregular sleeping patterns , use Alarmy , an amazing alar app that will, blast a music that will force you to wake up and solve math problems. These ofcourse are spefic solutions to specific problems, but you get the idea. Don’t get stuck up on one task. Have aleast 3 (not multi task, i’ll explian)Drop tasks as you go, in order to have a list of task that you will accomplish.Having things on your todo list is not an accomplishment , getting them done is, there are centain tasks that will streact their timeline or will just have a lower priority and hence in order for you to stay focused while important tasks don’t bother you in the background, drop the less important task. Another example of where i use this rule, is when i plan out my saturday and sunday tasks , usually its a combined todo list that i have for the weekend. If for example i don’t accoplish 50% of the tasks on saturday , i drop some of the weekend tasks. This is done so that i am not stressed out on sunday and can lazer focus on what i setout to do. Keep a single task for the last productive hour.A more specific rule for the above one, but for good measure. On a typical weekday, you’ve slogged out the whole day and have very little left in the tank. don’t overestimate how much you can do. Just keep one single task to be done and do it !!. Having multiple tasks to do will only tangle your brain. Have a not to-do list.","link":"/peckingatcode/2020/09/08/keep-your-day-productive/"},{"title":"Git stash staged files only","text":"If you’ve been using git for a while , chances are you’ve come across the scenario where you need to stash not all your changes , but just the changes you’ve staged. In this scenario you can simply double stash in 2 simple steps. 1$ git stash --keep-index the above saves all your changes in a stash but keeps the staging changes in the working directory. then you can just 1$ git stash push -m 'staging changes only' Now you have your stash with staging changes only.","link":"/peckingatcode/2020/11/15/git-stash-staged-files-only/"},{"title":"Identify content type of API response","text":"You can set 1response.headers.get(\"Content-Type\") And then use 1.get(param) Source :- stack overflow","link":"/peckingatcode/2020/11/10/identify-content-type-of-API-response/"},{"title":"How to get a nested object value using lodash.","text":"Often we are faced with the scenario when a nested value of an obeject needs to be passed into a variable or parameter to an API. something like below: 123MyObject = { a: [ '1' , { a : 'i am inner a' } ]} and the value can be extracted fairly easily using the dot ot arrow notation like so: 1const value = MyObject.a[1].a we may also want to check if the index 1 actually exist so added a check would be advisable or your app, webpage could break, so we could simple add a trivial check like below: 12// A better alternative to the above piece of code const value = MyObject.a.length &gt; 0 &amp;&amp; MyObject.a[1].a Now a game changer would be if we are using a library like lodash, which extacts the nested value, irrespective of how deeply nested it is and spits out undefined if at any level the value if not to be found. so the code can be condensed to a single like like below: 12345const myObj = { a: [ '1' , { a : 'i am inner a' } ]}const value = _.get(myObj, 'a[1].a.d') Now instead of undefined, if you’d like a default value, you can set it like so 1const value = _.get(myObj, 'a[1].a.d') Thats all there is to it !","link":"/peckingatcode/2020/11/22/how-to-get-a-nested-object-value-using-lodash/"},{"title":"just-a-test-man","text":"we may also want to check if the index 1 actually exist so added a check would be advisable or your app, webpage could break, so we could simple add a trivial check like below: I am here just to test stuff man !","link":"/peckingatcode/2021/02/24/just-a-test-man/"}],"tags":[{"name":"git","slug":"git","link":"/peckingatcode/tags/git/"},{"name":"javascript","slug":"javascript","link":"/peckingatcode/tags/javascript/"},{"name":"productivity","slug":"productivity","link":"/peckingatcode/tags/productivity/"},{"name":"svg","slug":"svg","link":"/peckingatcode/tags/svg/"},{"name":"fetch","slug":"fetch","link":"/peckingatcode/tags/fetch/"},{"name":"github","slug":"github","link":"/peckingatcode/tags/github/"},{"name":"lodash","slug":"lodash","link":"/peckingatcode/tags/lodash/"}],"categories":[]}